    "cte_std_culinary_arts_1.pdf": [
        "Sequence: Family, Career and Community Leaders of America (FCCLA): Aligned Student http://www.tennesseefccla.org/ Organization(s): SkillsUSA: http://www.skillsusatn.org/ Credentials are aligned with postsecondary and employment opportunities and with the competencies and skills that students Promoted Tennessee acquire through their selected program of study. For a listing of Student Industry promoted student industry credentials, Credentials: visit https://www.tn.gov/education/educators/career-and-technical- education/student-industry-certification.html. (050 and 060), (050 and 453), (051 and 060), (051 and 453), (154 and Teacher Endorsement(s):",
        "155), (450 and 060), (450 and 453), 562, 563, 564, 566, 730 ServSafe Food Manager, National Registry of Food Safety Required Teacher Professionals, Certified Culinary Educator (CCE) Certification, or Certifications/Training: Certified Secondary Culinary Educator (CSCE) Certification https://www.tn.gov/education/educators/career-and-technical- education/career-clusters/cte-cluster-hospitality-tourism.html Teacher Resources: Best for All Central: https://bestforall.tnedu.gov/ Course at a Glance CTE courses provide students with an opportunity to develop specific academic, technical, and 21st century skills necessary to be successful in career and in life. In pursuit of ensuring every student in Tennessee achieves this level of success, we begin with rigorous course standards which feed into intentionally designed programs of study. Students engage in industry relevant content through general education integration and experiences such as career and technical student organizations (CTSO) and work-based learning (WBL). Through these experiences, students are immersed with industry standard content and technology, solve industry-based problems, meaningfully interact with industry professionals and use/produce industry specific, informational texts. Using a Career and Technical Student Organization (CTSO) in Your Classroom CTSOs are a great resource to put classroom learning into real-life experiences for your students through classroom, regional, state, and national competitions, and leadership opportunities. Below are CTSO connections for this course, note this is not an exhaustive list. • Participate in the CTSO Fall Leadership Conference, DECA and FCCLA Fall Leadership Camps, FCCLA District STAR Events, SkillsUSA State Leadership and Skills Conference, and the DECA Emerging Leader Summit to engage with peers, demonstrate logical thought processes, and develop industry specific skills that involve teamwork and project management. • Participate in conferences that promote career development such as DECA Career Pathways and Career Development Conferences. • Participate in FCCLA and SkillsUSA career competitive events that highlight career development, including career investigation, interviewing, job skills demonstrations, career pathways showcases, and employment application process (ADA). • Participate in DECA competitive events such as Food Marketing, Quick Serve Restaurant Management Series, Restaurant and Food Service Management, and Virtual Business Challenge – Restaurant. • Participate in FCCLA and SkillsUSA competitive events such as Applied Math for Culinary Management, Baking and Pastry, Culinary Arts, Food Innovations, Nutrition and Wellness, Commercial Baking, and Culinary Arts. For more ideas and information, visit Tennessee DECA at https://www.tndeca.org/, Tennessee FCCLA at https://www.tennesseefccla.org/, and Tennessee SkillsUSA at skillsusatn.org. Using Work-Based Learning (WBL) in Your Classroom Sustained and coordinated activities that relate to the course content are the key to successful work- based learning. Possible activities for this course include the following. This is not an exhaustive list. • Standards 1.1-1.3 | Workplace tours and job shadowing of local restaurants and other commercial kitchen facilities to facilitate students’ understanding of safety and sanitation in the foodservice industry and provide students with hands-on experience. • Standards 3.1-3.2 | Workplace tour of a kitchen workstation from a locally owned restaurant or the school’s cafeteria kitchen. • Standard 3.3 | Guest speakers from foodservice industry to discuss current issues and challenges within this industry. • Standards 4.1-4.2 | Guest speakers from foodservice industry (including nutritionists) to help students master their understanding of nutrition and health standards. • Standards 6.1-8.1 | On-the-job training as part of recommended 30 hours in commercial kitchen laboratory to demonstrate mastery of knife cuts, use of kitchen staples, and cooking principles. • Standards 9.1-10.2 | Workplace tours and job shadowing to develop students’ mastery of Garde Manager skills, including salad and sandwich preparation. May 2023 | Page 3 Course Description Culinary Arts I equips students with the foundational knowledge and skills to pursue careers in the culinary field as competent entry-level quick service and fast-food employees. Throughout the course, students will gain experience in commercial food production and service operations, while preparing for further training in the culinary arts program of study at the secondary and postsecondary levels. Upon completion of this course, proficient students will know the components of commercial kitchen safety and sanitation, history of the foodservice industry, hospitality careers, nutritional concepts, recipe basics, proper kitchen tools and equipment, and kitchen staples. Students will create artifacts to include in a portfolio that they will maintain throughout the course sequence. In addition to implementing the following standards, the course should include a suggested 30 hours in a commercial kitchen laboratory. Course Standards",
        "1. Food Safety & Sanitation",
        "1.1 Food Pathogens: Identify the pathogens found in foods and illustrate the required environmental factors for transmission, symptoms, and categories of these pathogens.",
        "1.2 Disposal & Storage of Chemicals: Summarize the requirements for proper disposal and storage of chemicals used in the commercial foodservice laboratory and adhere to laboratory work requirements throughout the course. Maintain Material Safety Data Sheets (MSDS) outlining how to work with chemicals and potential hazards and identify procedures when cleaning and sanitizing the commercial foodservice laboratory using the proper chemicals and disposal of waste.",
        "1.3 Safety & Sanitation Procedures: Practice and critique safety and sanitation procedures for handling, preparing, storing, and serving food. Identify, review, and demonstrate general laboratory safety procedures, including prevention and control procedures of pest, insects, and rodents and personal hygiene expectations. Incorporate safety procedures and complete safety test with 100 percent accuracy.",
        "2. History of the Food Service Industry",
        "2.1 Culinary Events & Milestones: Identify important historical events and milestones that have influenced culinary practices and cuisine styles from ancient times to the present.",
        "2.2 Foodservice Industry Growth & Development: Research the growth and development of the foodservice industry, focusing on the influence of significant contributors, including: Maire-Antoine Careme, Auguste Escoffier, Catherine de Medici, Fernand Point, and Alexis Soyer.",
        "2.3 Influential Factors: Evaluate the various factors that influence the foodservice industry, including, for example: economic climate, social changes, globalization of cuisines, green technologies, and farm-to-table. May 2023 | Page 3",
        "3. Foodservice Career Exploration",
        "3.1 Foodservice Occupations: Compile and analyze real-time labor market data, including economic and demographic trends, and compare with authentic vacancy announcements on local and national job boards. Examine occupations by education requirements, job availability, salaries, and benefits. Outline an educational pathway to obtain the necessary level of education and relevant certifications for a chosen occupation in the foodservice industry.",
        "3.2 Brigade System: Create an organizational diagram of the kitchen workstations in the brigade system, labeling each workstation with its specific roles and responsibilities. Examine the licensing, certification, and credentialing requirements for each position.",
        "3.3 Teamwork & Collaboration: Compare and contrast the qualities of effective and ineffective teams. Throughout the course, demonstrate teamwork, problem solving, and decision- making skills when working collaboratively.",
        "4. Nutrition and Health",
        "4.1 Macro- and Micro-Nutrients: Identify and analyze macro- and micro- nutrients required in the human diet. Include the common food sources of those nutrients, their chemical properties, and function in the body, as well as the influence upon biological systems in reference to maintenance and growth. a. Macronutrients include: carbohydrates, lipids, and proteins b. Micronutrients include: minerals, vitamins, and water",
        "4.2 Food Allergies & Intolerances: Compare food allergies and food intolerances and the body’s reaction to each. Research the eight (8) most common food allergens and recommend food substitutes and recipe modifications to avoid foods that may cause a reaction.",
        "5. Recipe Basics",
        "5.1 Recipe Anatomy: Examine the anatomy of a recipe, identifying the key points and functions of each (name, yield, portion size, ingredients, quantity, and methods) and define common recipe terminology.",
        "5.2 Standardized vs. Home Recipe: Compare the components of a standardized recipe with a home recipe. Apply the correct conversion factor to increase and decrease the yield according to specifications noted in recipes.",
        "5.3 Recipe Instructions: Follow recipes precisely. Define and use specific culinary and measurement terms as needed and determine food product waste reduction methods. May 2023 | Page 3",
        "6. Kitchen Equipment",
        "6.1 Hand tools & Smallwares: Identify, describe, and effectively demonstrate the use of hand tools and smallwares in commercial food preparation. Identify the functions, cleaning procedures, storage, and examples of proper use of tools in commercial foodservice.",
        "6.2 Large Commercial Kitchen Equipment: Examine various pieces of large commercial kitchen equipment, including refrigeration units, holding units, grills and broilers, ranges, and ovens. Explain each piece’s design properties and functionality. Determine the appropriate equipment needed to perform various tasks in a commercial kitchen, while demonstrating safe use and proper cleaning procedures.",
        "6.3 Measuring Tools: Identify the appropriate measuring tools (e.g., measuring cups, pitchers, spoons, scales, and thermometers) for various ingredients. Use proper measurements for recipe ingredients in lab settings.",
        "7. Preparation Techniques",
        "7.1 Knife Types: Distinguish among the different types of knives (e.g., paring, serrated, slicers, utility, and chef’s) and explain their elements of construction. Identify and demonstrate the correct use, sharpening techniques, safety handling, and storage options for each knife.",
        "7.2 Knife Cuts: Prepare a workstation for knife work and practice and execute the three basic knife cuts (slice, stick, and dice) using the correct safety methods. Include a picture or video in the student portfolio to document correct use.",
        "8. Cooking Principles",
        "8.1 Cooking Methods: Compare dry, moist, and combination cooking methods. Describe each method, locate an example recipe for each, and demonstrate the technique in a laboratory setting. Examples may include: a. blanching, b. baking, c. grilling, d. frying, e. poaching, f. boiling, and g. broiling.",
        "9. Kitchen Staples",
        "9.1 Basic Seasonings: Create an index of basic seasonings, herbs, and spices used in professional kitchens. Assess the cost of using fresh herbs versus substituting dried herbs without affecting final product’s quality.",
        "9.2 Sweeteners: Determine the differences in form and flavor for various sweeteners (i.e. sugar, molasses, honey, brown sugar, maple syrup, corn syrup, and agave nectar) in a taste May 2023 | Page 3 test/observation in the lab setting. Discuss common substitutions for sweeteners in recipes without compromising quality.",
        "9.3 Starches: Compare types of starches used in commercial kitchens and describe the physical properties of each: a. Flour (all-purpose, semolina, rice flour) b. Cornmeal c. Cornstarch d. Arrowroot e. Breadcrumbs (panko, dried, and fresh breadcrumbs)",
        "9.4 Acids: Identify the roles of acids in food preparation techniques. Acids may include vinegars, lemon juice, and lime juice.",
        "10. Garde Manger",
        "10.1 Salads & Salad Types: Compare types of salads (i.e. simple, composed, and bound) and their ingredients. Discuss the qualities of simple and emulsified dressings. Evaluate a salad recipe, analyzing the choice of ingredients, as well as any proposed modifications or substitute ingredients. Draft the modified recipe with modification and prepare the salad.",
        "10.2 Sandwiches & Sandwich Types: Categorize types of sandwiches, including their ingredients, assembly methods, and attributes. Create a recipe for a cold sandwich that reflects local tastes and culinary trends. The following artifacts will reside in the student portfolio: • Index of pathogens • Persuasive contemporary issues essay • List of procedures for cleaning and • Allergy Substitution Recommendation sanitizing • Knife how-to-graphic • Safety Exam • Documentation of knife cuts • History events and milestones • Cooking Principle artifact timeline • Seasoning Index • Contributor paper • Common Substitution • Educational Pathway Assignment • Starch chart • Organizational diagram of work • Sandwich Recipe sessions • Salad Recipe Standards Alignment Notes *References to other standards include: • P21: Partnership for 21st Century Skills Framework for 21st Century Learning o Note: While not all standards are specifically aligned, teachers will find the framework helpful for setting expectations for student behavior in their classroom and practicing specific career readiness skills. May 2023 | Page 3"
    ],
